In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
user_data = pd.read_csv('data/BX-CSV/BX-Users.csv', delimiter=';', encoding='latin-1')
book_data = pd.read_csv('data/BX-CSV/BX-Books.csv', delimiter=';', encoding='latin-1', on_bad_lines='skip',low_memory=False)
rating_data = pd.read_csv('data/BX-CSV/BX-Book-Ratings.csv', delimiter=';', encoding='latin-1')

### working on the user data

In [3]:
user_data.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [4]:
user_data['Country'] = user_data['Location'].map(lambda x: x.split(', '))
user_data['Country'] = user_data['Country'].map(lambda x: x[-1])

In [5]:
user_data = user_data.drop(['Location', 'Age'], axis=1)
user_data.head()

   User-ID         Country
0        1             usa
1        2             usa
2        3          russia
3        4        portugal
4        5  united kingdom

In [7]:
user_data['Country'].value_counts()

usa                139711
canada              21658
united kingdom      18538
germany             17043
spain               13147
                    ...
tehran,                 1
lisbon,                 1
lesotho,                1
-                       1
united kingdom.         1
Name: Country, Length: 1152, dtype: int64

In [6]:
user_data['Country'].values

array(['usa', 'usa', 'russia', ..., 'canada', 'usa', 'ireland'],
      dtype=object)

### separating data by regions in usa and spain

In [10]:
regional_data = user_data[(user_data['Country'] == 'spain')|(user_data['Country'] == 'usa')]

In [18]:
regional_data.sample(10)

        User-ID Country
249782   249783     usa
43068     43069     usa
263041   263042     usa
252664   252665     usa
137659   137660     usa
189413   189414     usa
9744       9745     usa
263200   263201     usa
257087   257088     usa
97098     97099     usa

In [19]:
regional_data.shape

(152858, 2)

### working on book data

In [21]:
book_data.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [26]:
book_data = book_data.drop(['Publisher','Image-URL-S', 'Image-URL-M', 'Image-URL-L'], axis=1)

In [27]:
book_data.shape

(271360, 4)

In [33]:
book_data.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication
0,0195153448,Classical Mythology,Mark P. O. Morford,2002
1,0002005018,Clara Callan,Richard Bruce Wright,2001
2,0060973129,Decision in Normandy,Carlo D'Este,1991
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999

### working on ratings data

In [34]:
rating_data.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [41]:
rating_data['Book-Rating'].value_counts()

0     716109
8     103736
10     78610
7      76457
9      67541
5      50974
6      36924
4       8904
3       5996
2       2759
1       1770
Name: Book-Rating, dtype: int64

In [36]:
rating_data.shape

(1149780, 3)

In [89]:
# merging book_data so as to know the names of books being rated
ratings = rating_data.merge(book_data, on='ISBN')
ratings.head()

,User-ID,ISBN,Book-Rating,Book-Title,Book-Author,Year-Of-Publication
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002
1,2313,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002
2,6543,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002
3,8680,034545104X,5,Flesh Tones: A Novel,M. J. Rose,2002
4,10314,034545104X,9,Flesh Tones: A Novel,M. J. Rose,2002

In [38]:
ratings.shape

(1031136, 6)

In [91]:
# get rated books above 200
count_ratings = ratings['Book-Title'].value_counts() > 200
col = count[count == True]
col.index

Index(['Wild Animus', 'The Lovely Bones: A Novel', 'The Da Vinci Code',
       'A Painted House', 'The Nanny Diaries: A Novel',
       'Bridget Jones's Diary', 'The Secret Life of Bees',
       'Divine Secrets of the Ya-Ya Sisterhood: A Novel',
       'The Red Tent (Bestselling Backlist)', 'Angels &amp; Demons',
       ...
       'Dust to Dust', 'Jemima J: A Novel About Ugly Ducklings and Swans',
       'Three Fates', 'Cold Sassy Tree', 'Ellen Foster', 'Night',
       'Tears of the Giraffe (No.1 Ladies Detective Agency)',
       'The Virgin Suicides', 'Blessings', 'On the Street Where You Live'],
      dtype='object', length=293)

In [92]:
rated_data = ratings[ratings['Book-Title'].isin(col.index)]

In [93]:
rated_data.shape

(98445, 6)

In [96]:
rated_data.head()

,User-ID,ISBN,Book-Rating,Book-Title,Book-Author,Year-Of-Publication
62,276727,0446520802,0,The Notebook,Nicholas Sparks,1996
63,278418,0446520802,0,The Notebook,Nicholas Sparks,1996
64,638,0446520802,0,The Notebook,Nicholas Sparks,1996
65,3363,0446520802,0,The Notebook,Nicholas Sparks,1996
66,7158,0446520802,10,The Notebook,Nicholas Sparks,1996

In [128]:
rated_data.shape

(98445, 6)

In [129]:
rated_data['User-ID'].value_counts()

11676     467
35859     231
16795     186
238120    177
23768     172
         ...
173623      1
178562      1
178568      1
193500      1
274282      1
Name: User-ID, Length: 27719, dtype: int64

In [97]:
pivoted = pd.pivot(rated_data, index='User-ID', columns='ISBN', values='Book-Rating')

In [130]:
pivoted.loc[11676 ].isna().value_counts()

True     655
False    467
Name: 11676, dtype: int64

In [121]:
pivoted.head()

ISBN,0001047973,0020697406,0060093102,0060094818,0060129565,0060158638,0060168013,006017322X,0060175400,0060198133,...,B00006JO6O,B00007CWQC,B00008WFXL,B00009EF82,B0000C7BNG,B0000E63CJ,B0000T6KHI,B0000VZEH8,B0001FZGPI,B0001PIOX4
User-ID,,,,,,,,,,,,,,,,,,,,,
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN